## 기말 시험

기말 시험은 총 40점으로, 각 문항의 배점은 5점 입니다.  
부분점수가 주어지니 최선을 다 해 풀어주세요.

Kaggle에 있는 실제 데이터셋으로 기말시험을 수행해보려고 합니다.  
본 데이터셋은 Titanic 데이터셋으로, 타이타닉에 탑승한 승객들에 대한 정보를 담고 있으며, 해당 승객이 살았는지 사망했는지에 대한 정보 또한 담고 있습니다. 

데이터에 대한 자세한 사항은 다음 링크를 참고하세요
https://www.kaggle.com/c/titanic/data?select=train.csv

In [2]:
import pandas as pd
import numpy as np

### 1. 데이터 읽기

#### 1-1 `train.csv` 데이터를 읽어온 후 1) 데이터의 행과 열의 갯수 및 2) 기초 통계값을 출력해 봅시다. `describe` method 활용  
(5점)

In [5]:
df=pd.read_csv('train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [36]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 2. Data Query 하기

#### 2-1 나이가 60살 이상이 사람들 중에 생존한 사람들을 출력해봅시다. Survived 값이 0이 사망한 사람이며, 1이 생존한 사람입니다.  
(5점)

In [6]:
A=[]
for name in df:
     if df[name][1]<=60:
             if df[name][0]==1:
                     A.append(name)
A

TypeError: '<=' not supported between instances of 'str' and 'int'

#### 2-2 위의 데이터를 `Age` 컬럼을 기준으로 나이가 많은 순에서 적은 순으로 정렬해 봅시다. 나이가 가장 많은 10명의 데이터 프레임을 출력해봅시다.   
(5점)

In [56]:
df['Age']
df['Age'].sort_values(axis=0,ascending=False)

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

#### 2-3 Pclass는 해당 승객이 묵었던 객실의 등급을 나타냅니다. 1등석, 2등석, 3등석에 탑승한 승객이 각각 몇명인지 출력하시오.  
(5점)

### 3. 결측치 처리하기

#### 3-1 `Cabin` 컬럼은 승객이 탑승한 객실의 호수를 나타냅니다. 해당 컬럼에 결측치가 총 몇개인지를 출력하시오  
(5점)

In [33]:
df['Cabin'].isnull()

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: Cabin, Length: 891, dtype: bool

#### 3-2 `Embarked` 컬럼은 승객이 탑승한 항구를 나타냅니다. 해당 컬럼의 결측치가 몇개인지 마찬가지로 출력하고, 해당 결측치를 가장 빈도가 높은 Embarked 값으로 채워넣으시오.  
(5점)

In [8]:
df['Embarked']
df['Embarked'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Embarked, Length: 891, dtype: bool

#### 3-3 Age 변수에도 결측치는 존재합니다. 결측치인 나이 값을 전체 나이 평균으로 채워넣어 봅시다  
(5점)

In [64]:
A=df['Age'].mean
A
df['Age'].fillna(A)

0                                                   22.0
1                                                   38.0
2                                                   26.0
3                                                   35.0
4                                                   35.0
                             ...
886                                                 27.0
887                                                 19.0
888    <bound method NDFrame._add_numeric_operations....
889                                                 26.0
890                                                 32.0
Name: Age, Length: 891, dtype: object

### 4. 연속형 변수 이산형 변수로 변환하기

#### 나이(`Age`)를 10세 이하(young), 10초과-60세 미만(adult), 60세 초과-100세 이하(senior) 세 그룹으로 구분하여 Discretize(이산화) 시켜봅시다. 해당 데이터를 `Age_group` 이란 이름의 새로운 컬럼으로 저장하여 봅시다. 마지막으로, 그룹의 생존율을 계산해 봅시다.  
(5점)

Survived 값이 0이 사망한 사람이며, 1이 생존한 사람입니다.